app/views/coupons/_form.html.erb

      <label class="block">Centre(s)</label>
      <%= f.collection_select :franchise_ids, Franchise.all.order(:name), :id, :name, { }, { multiple: true } %>
---
SELECT "franchises".* FROM "franchises" ORDER BY "franchises"."name" ASC