app/views/clients/_form.html.erb

SELECT "franchises".* FROM "franchises" ORDER BY "franchises"."name" ASC
---
  <% if current_user.superuser %>
    <p><%= f.label :franchise_id, 'Centre' %><%= f.collection_select :franchise_id, Franchise.all.order(:name), :id, :name %></p>