app/views/welcome/home.html.erb

        <ul>
          <% monday = current_franchise.business_hours.find_by(day: 'Monday') %>
          <li><i class="far fa-clock"></i> &nbsp;lundi au vendredi : <%= monday.morning_start_time %> à <%= monday.morning_end_time %> - <%= monday.afternoon_start_time %> à <%= monday.afternoon_end_time %></li>
          <% saturday = current_franchise.business_hours.find_by(day: 'Saturday') %>
---
SELECT "business_hours".* FROM "business_hours" WHERE "business_hours"."franchise_id" = $1 AND "business_hours"."day" = $2 LIMIT $3  [["franchise_id", 1], ["day", "Monday"], ["LIMIT", 1]]
SELECT "business_hours".* FROM "business_hours" WHERE "business_hours"."franchise_id" = $1 AND "business_hours"."day" = $2 LIMIT $3  [["franchise_id", 1], ["day", "Saturday"], ["LIMIT", 1]]