app/views/franchises/index.html.erb

      <td><%= franchise.siret.present? ? franchise.siret : '∅' %></td>
      <td><%= franchise.users.size %></td>
---
SELECT COUNT(*) FROM "users" WHERE "users"."franchise_id" = $1  [["franchise_id", 1]]