app/views/franchises/show.html.erb

  <h2>Horaires d'ouverture (<a href="#" data-target="#edit-business-hours">modifier</a>)</h2>
  <% @franchise.business_hours.each do |business_hour| %>
---
SELECT "business_hours".* FROM "business_hours" WHERE "business_hours"."franchise_id" = $1  [["franchise_id", 1]]