app/controllers/application_controller.rb

SELECT "franchises".* FROM "franchises" ORDER BY "franchises"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def current_franchise
    Franchise.all.each do |franchise|

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    user_id = session[:user_id]
    if user_id.nil?
      redirect_to admin_path
    else
      User.find(user_id)

SELECT "clients".* FROM "clients" WHERE "clients"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT "company_clients".* FROM "company_clients" WHERE "company_clients"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def current_client
    Client.find_by(id: session[:client_id]) || CompanyClient.find_by(id: session[:company_client_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def authenticate_superadmin
    if session[:user_id].nil?
      redirect_to admin_path
    else
      user = User.find(session[:user_id])