app/controllers/application_controller.rb

  def current_client
    Client.last
---
SELECT "clients".* FROM "clients" ORDER BY "clients"."id" DESC LIMIT $1  [["LIMIT", 1]]