app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sayid.mimouni@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "last_logged_at" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-10-05 10:35:19.037270"], ["last_logged_at", "2021-10-05 10:35:19.007549"], ["id", 1]]
---
  def admin
    if request.post?
      user = User.find_by_email(params[:email])
      if user && user.authenticate(params[:password])
        session[:user_id] = user.id
        user.update last_logged_at: Time.now