app/controllers/clients_controller.rb

  def find_client
    id = params[:client_id].present? ? params[:client_id] : params[:id]
    if current_user.superuser
      @client = Client.find(id)
    elsif current_user.nutritionist
      @client = current_user.clients.find(id)
    else
      @client = current_user.franchise.clients.find(id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]