app/controllers/coupons_controller.rb

SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_coupon
    if current_user.superuser
      @coupon = Coupon.find(params[:id])
    else
      @coupon = current_user.franchise.coupons.find(params[:id])