app/controllers/franchises_controller.rb

  def show
    @franchise = Franchise.find params[:id]
---
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]