app/controllers/products_controller.rb

SELECT "rooms".* FROM "rooms"
---
  def index
    @product = current_user.franchise.products.new
    if current_user.superuser
      @rooms = Room.all

SELECT "products".* FROM "products"
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_product
    if current_user.superuser
      @product = Product.find params[:id]
    else
      @product = current_user.franchise.products.find(params[:id])