app/controllers/stats_controller.rb

SELECT "products".* FROM "products" INNER JOIN "rooms" ON "products"."room_id" = "rooms"."id" WHERE "rooms"."franchise_id" = $1  [["franchise_id", 1]]
SELECT "payments".* FROM "payments" WHERE "payments"."product_name" = $1  [["product_name", "Cryo Localisée"]]
SELECT SUM("payments"."amount") FROM "payments" WHERE "payments"."product_name" = $1 AND 1=0  [["product_name", "Cryo Localisée"]]
SELECT COUNT(*) FROM "payments" WHERE (id IN (NULL)) AND 1=0
SELECT COUNT(*) FROM "reservations" INNER JOIN "product_prices" ON "reservations"."product_price_id" = "product_prices"."id" WHERE "product_prices"."product_id" = $1 AND 1=0  [["product_id", 1]]
---
  def index
    @date = params[:date].present? ? params[:date].to_date : Date.today
    @products = current_user.franchise.products
    @external_products = current_user.franchise.external_products

    @average_payments_amount = {}
    @products.each do |product|
      @average_payments_amount[product.id] = product.average_payments_amount
    end

    @revenue = {}
    @products.each do |product|
      @revenue[product.id] = Payment.by_product(product.name).successful.sum(:amount).to_i*0.8/100
    end

    @reservations_count = {}
    @products.each do |product|
      @reservations_count[product.id] = product.reservations.paid.count