app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_user
    if current_user.superuser
      @user = User.find params[:id]
    else
      @user = current_user.franchise.users.find(params[:id])