app/controllers/welcome_controller.rb

SELECT "products".* FROM "products" INNER JOIN "rooms" ON "products"."room_id" = "rooms"."id" WHERE "rooms"."franchise_id" = $1  [["franchise_id", 1]]
---
  def home
    @products = current_franchise&.products&.includes([:thumbnail_attachment])&.active