app/models/franchise.rb

INSERT INTO "business_hours" ("franchise_id", "day", "morning_start_time", "morning_end_time", "afternoon_start_time", "afternoon_end_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create_business_hours
    ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday'].each do |day|
      business_hours.create!(
        day: day,
        morning_start_time: '09:00',
        morning_end_time: '12:00',
        afternoon_start_time: '14:00',
        afternoon_end_time: '20:00',
      )