app/models/payment.rb

  def self.successful
    ids = []
    all.each do |payment|
---
SELECT "payments".* FROM "payments" WHERE (id IN (NULL))