app/views/layouts/welcome.html.erb

        <ul>
          <% current_franchise.products.order(:name).each do |product| %>
---
SELECT "products".* FROM "products" INNER JOIN "rooms" ON "products"."room_id" = "rooms"."id" WHERE "rooms"."franchise_id" = $1 ORDER BY "products"."name" ASC  [["franchise_id", 1]]